const academicStructure = {
    'first_secondary': {
        label: 'الصف الأول الثانوي',
        all_materials: [
            'اللغة العربية', 'اللغة الإنجليزية', 'التاريخ', 'الرياضيات',
            'الفيزياء', 'الكيمياء', 'الأحياء', 'الفلسفة والمنطق', 'التربية الدينية',
            'اللغة الفرنسية', 'اللغة الألمانية', 'البرمجة وعلوم الحاسب', 'EG التربية الوطنية',
            'التربية المهنية'
        ]
    },
    'second_secondary': {
        label: 'الصف الثاني الثانوي',
        all_materials: [
            'اللغة العربية', 'التاريخ', 'اللغة الإنجليزية', 'اللغة الفرنسية', 'اللغة الألمانية',
            'الفيزياء', 'الكيمياء', 'الأحياء', 'الرياضيات', 'علم النفس', 'فلسفة',
            'الجغرافيا', 'علم اجتماع'
        ]
    },
    'third_secondary': {
        label: 'الصف الثالث الثانوي',
        all_materials: [
            'اللغة العربية', 'التاريخ', 'اللغة الإنجليزية', 'اللغة الفرنسية', 'اللغة الألمانية',
            'الأحياء', 'الجيولوجيا', 'الكيمياء', 'الفيزياء', 'الرياضيات التطبيقية', 'الهندسة الفراغية',
            'الإحصاء', 'علم النفس', 'علم اجتماع', 'الفلسفة', 'المنطق', 'الجغرافيا'
        ]
    }
};

export default academicStructure;